GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/m66.c
/*
   发送AT命令，并等待响应函数处理
   参照 code.google.com/p/gsm-playground的实现
 */

int8_t SendATCmdWaitRespFunc( char *AT_cmd_string,
                              uint32_t timeout,
                              RESP_FUNC respfunc,
                              uint8_t no_of_attempts )
{
	rt_err_t		err;
	uint8_t			i;
	char			*pmsg;
	uint32_t		tick_start, tick_end;
	uint32_t		tm;
	__IO uint8_t	flag_wait;

	char			* pinfo;
	uint16_t		len;

	for( i = 0; i < no_of_attempts; i++ )
	{
		tick_start	= rt_tick_get( );
		tick_end	= tick_start + timeout;
		tm			= timeout;
		flag_wait	= 1;
		rt_kprintf( "%08d gsm>%s\r\n", tick_start, AT_cmd_string );
		m66_write( &dev_gsm, 0, AT_cmd_string, strlen( AT_cmd_string ) );
		while( flag_wait )
		{
			err = rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pmsg, tm );
			if( err != -RT_ETIMEOUT )                   /*没有超时,判断信息是否正确*/
			{
				len		= ( *pmsg << 8 ) | ( *( pmsg + 1 ) );
				pinfo	= pmsg + 2;
				if( respfunc( pinfo, len ) == RT_EOK )  /*找到了*/
				{
					rt_free( pmsg );                    /*释放*/
					return RT_EOK;
				}
				rt_free( pmsg );                        /*释放*/
				/*计算剩下的超时时间,由于其他任务执行的延时，会溢出,要判断*/
				if( rt_tick_get( ) < tick_end )         /*还没有超时*/
				{
					tm = tick_end - rt_tick_get( );
				}else
				{
					flag_wait = 0;
				}
			}else /*已经超时*/
			{
				flag_wait = 0;
			}
		}
	}
	return ( RT_ETIMEOUT );
}

/*
   判断一个字符串是不是表示ip的str
   如果由[0..9|.] 组成
   '.' 0x2e   '/' 0x2f   '0' 0x30  '9' 0x39   简化一下。不判断 '/'
   返回值
   0:表示域名的地址
   1:表示是IP地址

 */
static uint8_t is_ipaddr( char * str )
{
	char *p = str;
	while( *p != NULL )
	{
		if( ( *p > '9' ) || ( *p < '.' ) )
		{
			return 0;
		}
		p++;
	}
	return 1;
}

/*gsm供电的处理纤程*/
static void rt_thread_gsm_power_on( void* parameter )
{
	rt_err_t ret;

lbl_poweron_start:
	rt_kprintf( "%08d gsm_power_on>start\r\n", rt_tick_get( ) );
//	gsm_state = GSM_POWERONING; /*置位上电过程中*/

	GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
	GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
	rt_thread_delay( RT_TICK_PER_SECOND / 10 );
	GPIO_SetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
	GPIO_SetBits( GSM_PWR_PORT, GSM_PWR_PIN );

	if( WaitString( "OK", RT_TICK_PER_SECOND * 5 ) == RT_ETIMEOUT )
	{
		goto lbl_poweron_start;
	}

	if( WaitString( "OK", RT_TICK_PER_SECOND * 5 ) == RT_ETIMEOUT )
	{
		goto lbl_poweron_start;
	}

	if( SendATCmdWaitRespStr( "ATE0\r\n", RT_TICK_PER_SECOND * 5, "OK", 1 ) == RT_ETIMEOUT )
	{
		goto lbl_poweron_start;
	}

	ret = SendATCmdWaitRespStr( "ATV1\r\n", RT_TICK_PER_SECOND * 5, "OK", 1 );
	if( ret == RT_ETIMEOUT )
	{
		goto lbl_poweron_start;
	}

	ret = SendATCmdWaitRespStrWithOK( "AT%TSIM\r\n", RT_TICK_PER_SECOND * 5, "%TSIM 1", 1 );
	if( ret == RT_ETIMEOUT )
	{
		goto lbl_poweron_start;
	}

	ret = SendATCmdWaitRespStrWithOK( "AT+CPIN?\r\n", RT_TICK_PER_SECOND * 2, "+CPIN: READY", 30 );
	if( ret == RT_ETIMEOUT )
	{
		goto lbl_poweron_start;
	}

	ret = SendATCmdWaitRespFunc( "AT+CIMI\r\n", RT_TICK_PER_SECOND * 2, resp_CIMI, 10 );
	ret = WaitString( "OK", RT_TICK_PER_SECOND * 2 );
	if( ret == RT_ETIMEOUT )
	{
		goto lbl_poweron_start;
	}

	ret = SendATCmdWaitRespStr( "AT+CLIP=1\r\n", RT_TICK_PER_SECOND * 2, "OK", 2 );
	if( ret == RT_ETIMEOUT )
	{
		goto lbl_poweron_start;
	}

	ret = SendATCmdWaitRespFunc( "AT+CREG?\r\n", RT_TICK_PER_SECOND * 2, resp_CGREG, 30 );
	ret = WaitString( "OK", RT_TICK_PER_SECOND * 2 );
	if( ret == RT_ETIMEOUT )
	{
		goto lbl_poweron_start;
	}

	rt_kprintf( "%08d gsm_power_on>end\r\n", rt_tick_get( ) );

	gsm_state = GSM_AT; /*当前出于AT状态,可以拨号，连接*/
}

/*关于链路维护,只维护一个，多链路由上层处理*/
static void rt_thread_gsm_socket( void* parameter )
{
	char		buf[128];
	rt_err_t	err;


	/*挂断连接*/
	if( curr_socket.state == SOCKET_CLOSE )
	{
		return;
	}

	/*建立连接*/
	if( curr_socket.state != SOCKET_START )
	{
		return;
	}

	if( is_ipaddr( curr_socket.ipstr ) ) /*是IP地址*/
	{
		strcpy( curr_socket.ip_addr, curr_socket.ipstr );
		curr_socket.state = SOCKET_CONNECT;
	}else
	{
		curr_socket.state = SOCKET_DNS;
	}

	if( curr_socket.state == SOCKET_DNS )
	{
		sprintf( buf, "AT%%DNSR=\"%s\"\r\n", curr_socket.ipstr );
		err = SendATCmdWaitRespFunc( buf, RT_TICK_PER_SECOND * 10, resp_DNSR, 1 );
		if( err != RT_EOK )
		{
			curr_socket.state = SOCKET_DNS_ERR;
			goto lbl_gsm_socket_end;
		}
		curr_socket.state = SOCKET_CONNECT;
	}

	if( curr_socket.state == SOCKET_CONNECT )
	{
		if( curr_socket.type == 'u' )
		{
			sprintf( buf, "AT%%IPOPENX=%d,\"UDP\",\"%s\",%d\r\n", curr_socket.linkno, curr_socket.ip_addr, curr_socket.port );
		}else
		{
			sprintf( buf, "AT%%IPOPENX=%d,\"TCP\",\"%s\",%d\r\n", curr_socket.linkno, curr_socket.ip_addr, curr_socket.port );
		}
		err = SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND * 10, "CONNECT", 1 );
		if( err != RT_EOK )
		{
			curr_socket.state = SOCKET_CONNECT_ERR;
			goto lbl_gsm_socket_end;
		}
	}
	curr_socket.state = SOCKET_READY;
lbl_gsm_socket_end:
	gsm_state=GSM_TCPIP;		/*socket过程处理完成，结果在state中*/
	rt_kprintf( "%08d gsm_socket>end socket.state=%d\r\n", rt_tick_get( ), curr_socket.state );
}

/*控制登网，还是断网*/
static void rt_thread_gsm_gprs( void* parameter )
{
	char		buf[128];
	rt_err_t	err;

/*判断要执行怎样的动作*/

	if( dial_param.fconnect == 0 ) /*断网*/
	{
		err = SendATCmdWaitRespStr( "AT%IPCLOSE=1\r\n", RT_TICK_PER_SECOND, "OK", 1 );
		if( err == RT_ETIMEOUT )
		{
			goto lbl_gsm_gprs_end_err;
		}
		err = SendATCmdWaitRespStr( "AT%IPCLOSE=2\r\n", RT_TICK_PER_SECOND, "OK", 1 );
		if( err == RT_ETIMEOUT )
		{
			goto lbl_gsm_gprs_end_err;
		}
		err = SendATCmdWaitRespStr( "AT%IPCLOSE=3\r\n", RT_TICK_PER_SECOND, "OK", 1 );
		if( err == RT_ETIMEOUT )
		{
			goto lbl_gsm_gprs_end_err;
		}
		err = SendATCmdWaitRespStr( "AT%IPCLOSE=5\r\n", RT_TICK_PER_SECOND, "OK", 1 );
		err = WaitString( "%IPCLOSE:5", RT_TICK_PER_SECOND * 30 );
		if( err == RT_ETIMEOUT )
		{
			goto lbl_gsm_gprs_end_err;
		}
		gsm_state = GSM_AT;
		goto lbl_gsm_gprs_end;
	}

	if( dial_param.fconnect == 1 ) /*允许登网*/
	{
		err = SendATCmdWaitRespStrWithOK( "AT+CGATT?\r\n", RT_TICK_PER_SECOND * 2, "+CGATT: 1", 50 );
		if( err == RT_ETIMEOUT )
		{
			goto lbl_gsm_gprs_end_err;
		}

		sprintf( buf, "AT+CGDCONT=1,\"IP\",\"%s\"\r\n", dial_param.apn );
		err = SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND * 10, "OK", 1 );
		if( err != RT_EOK )
		{
			goto lbl_gsm_gprs_end_err;
		}
		if( ( strlen( dial_param.user ) == 0 ) && ( strlen( dial_param.user ) == 0 ) )
		{
			err = SendATCmdWaitRespStr( "AT%ETCPIP\r\n", RT_TICK_PER_SECOND * 151, "OK", 1 );
		}else
		{
			sprintf( buf, "AT%ETCPIP=\"%s\",\"%s\"\r\n", dial_param.user, dial_param.psw );
			err = SendATCmdWaitRespStr( buf, RT_TICK_PER_SECOND * 151, "OK", 1 );
		}
		if( err != RT_EOK )
		{
			goto lbl_gsm_gprs_end_err;
		}

		err = SendATCmdWaitRespFunc( "AT%ETCPIP?\r\n", RT_TICK_PER_SECOND * 10, resp_ETCPIP, 1 );
		err = WaitString( "OK", RT_TICK_PER_SECOND * 2 );
		if( err != RT_EOK )
		{
			goto lbl_gsm_gprs_end_err;
		}

		err = SendATCmdWaitRespStr( "AT%IOMODE=1,2,1\r\n", RT_TICK_PER_SECOND * 10, "OK", 1 );
		if( err != RT_EOK )
		{
			goto lbl_gsm_gprs_end_err;
		}

