GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/m66.c
		gsm_state = GSM_TCPIP;
		goto lbl_gsm_gprs_end;
	}
lbl_gsm_gprs_end_err:
	gsm_state = GSM_ERR_GPRS;
lbl_gsm_gprs_end:
	rt_kprintf( "%08d gsm_gprs>end state=%d\r\n", rt_tick_get( ), gsm_state );
}

/*
   tts语音播报的处理

   是通过
   %TTS: 0 判断tts状态(怀疑并不是每次都有输出)
   还是AT%TTS? 查询状态
 */
void tts_process( void )
{
	rt_err_t	ret;
	rt_size_t	len;
	uint8_t		*pinfo, *p;
	uint8_t		c;

	char		buf[20];
	char		tbl[16] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F' };
/*当前正在播报中*/
	if( tts_busy == 1 )
	{
		return;
	}
/*gsm在处理其他命令*/
	if( gsmbusy )
	{
		return;
	}
	gsmbusy = GSMBUSY_TTS;
/*是否有信息要播报*/
	ret = rt_mb_recv( &mb_tts, (rt_uint32_t*)&pinfo, 0 );
	if( ret == -RT_ETIMEOUT )
	{
		gsmbusy = GSMBUSY_NONE;
		return;
	}

	GPIO_ResetBits( GPIOD, GPIO_Pin_9 ); /*开功放*/

	sprintf( buf, "AT%%TTS=2,3,5,\"" );

	m66_write( &dev_gsm, 0, buf, strlen( buf ) );
	rt_kprintf( "%s", buf );

	len = ( *pinfo << 8 ) | ( *( pinfo + 1 ) );
	p	= pinfo + 2;
	while( len-- )
	{
		c = *p++;

		USART_SendData( UART4, tbl[c >> 4] );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
		{
		}
		rt_kprintf( "%c", tbl[c >> 4] );
		USART_SendData( UART4, tbl[c & 0x0f] );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
		{
		}
		rt_kprintf( "%c", tbl[c & 0x0f] );
	}
	buf[0]	= '"';
	buf[1]	= 0x0d;
	buf[2]	= 0x0a;
	buf[3]	= 0;
	m66_write( &dev_gsm, 0, buf, 3 );

	rt_kprintf( "%s", buf );

/*不判断，在gsmrx_cb中处理*/
	rt_free( pinfo );
	WaitString( "%TTS: 0", RT_TICK_PER_SECOND * 5 );
	GPIO_SetBits( GPIOD, GPIO_Pin_9 ); /*关功放*/
	gsmbusy = GSMBUSY_NONE;
}

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_stack[512];
struct rt_thread thread_gsm;

#if 0


/*
   状态转换，同时处理开机、登网、短信、TTS、录音等过程
 */
static void rt_thread_entry_gsm( void* parameter )
{
	rt_thread_t tid;

	while( 1 )
	{
		if( gsm_state == GSM_POWERON )
		{
			tid = rt_thread_create( "gsm_pwron", rt_thread_gsm_power_on, RT_NULL, 512, 7, 5 );
			if( tid != RT_NULL )
			{
				rt_thread_startup( tid );
				gsm_state = GSM_POWERONING; /*置位上电过程中*/
			}
		}
		if( gsm_state == GSM_POWEROFF )
		{
		}

		tts_process( );                     /*处理tts信息*/
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

#endif


/*
   状态转换，同时处理开机、登网、短信、TTS、录音等过程
 */
static void rt_thread_entry_gsm( void* parameter )
{
	while( 1 )
	{
		if( gsm_state == GSM_POWERON )
		{
			rt_thread_gsm_power_on( RT_NULL );
		}

		if( gsm_state == GSM_GPRS )
		{
			rt_thread_gsm_gprs( RT_NULL );
		}

		if( gsm_state == GSM_SOCKET_PROC)
		{
			rt_thread_gsm_socket(RT_NULL);
		}
		if( gsm_state == GSM_POWEROFF )
		{
		}

		tts_process( );         /*处理tts信息*/
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_rx_stack[512];
struct rt_thread thread_gsm_rx;


/*
   状态转换，同时处理短信、TTS、录音等过程
 */
static void rt_thread_entry_gsm_rx( void* parameter )
{
	unsigned char ch;

	while( 1 )
	{
		while( uart4_rxbuf_rd != uart4_rxbuf_wr )   /*有数据时，保存数据*/
		{
			ch				= uart4_rxbuf[uart4_rxbuf_rd++];
			uart4_rxbuf_rd	%= UART4_RX_SIZE;
			if( ch > 0x1F )                         /*可见字符才保存*/
			{
				gsm_rx[gsm_rx_wr++] = ch;
				gsm_rx_wr			%= GSM_RX_SIZE;
				gsm_rx[gsm_rx_wr]	= 0;
			}
			if( ch == 0x0d )
			{
				if( gsm_rx_wr )
				{
					gsmrx_cb( gsm_rx, gsm_rx_wr );                  /*接收信息的处理函数*/
				}
				gsm_rx_wr = 0;
			}
		}
		if( rt_tick_get( ) - last_tick > RT_TICK_PER_SECOND / 10 )  //等待100ms,实际上就是变长的延时,最迟100ms处理完一个数据包
		{
			if( gsm_rx_wr )
			{
				gsmrx_cb( gsm_rx, gsm_rx_wr );                      /*接收信息的处理函数*/
				gsm_rx_wr = 0;
			}
		}
		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gsm_init( void )
{
	rt_thread_t tid;

	rt_mb_init( &mb_gsmrx, "mb_gsmrx", &mb_gsmrx_pool, MB_GSMRX_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );
	rt_mb_init( &mb_tts, "mb_tts", &mb_tts_pool, MB_TTS_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );

	rt_thread_init( &thread_gsm,
	                "gsm",
	                rt_thread_entry_gsm,
	                RT_NULL,
	                &thread_gsm_stack[0],
	                sizeof( thread_gsm_stack ), 7, 5 );
	rt_thread_startup( &thread_gsm );

	rt_thread_init( &thread_gsm_rx,
	                "gsm_rx",
	                rt_thread_entry_gsm_rx,
	                RT_NULL,
	                &thread_gsm_rx_stack[0],
	                sizeof( thread_gsm_rx_stack ), 6, 5 );
	rt_thread_startup( &thread_gsm_rx );

	dev_gsm.type	= RT_Device_Class_Char;
	dev_gsm.init	= m66_init;
	dev_gsm.open	= m66_open;
	dev_gsm.close	= m66_close;
	dev_gsm.read	= m66_read;
	dev_gsm.write	= m66_write;
	dev_gsm.control = m66_control;

	rt_device_register( &dev_gsm, "gsm", RT_DEVICE_FLAG_RDWR );
	rt_device_init( &dev_gsm );
}

/*控制gsm状态 0 查询*/
rt_err_t gsmstate( int cmd )
{
	if( cmd )
	{
		gsm_state = cmd;
	}
	return gsm_state;
}

FINSH_FUNCTION_EXPORT( gsmstate, control gsm state );

/*控制gsm状态 0 查询*/
rt_err_t socketstate( int cmd )
{
	if( cmd )
	{
		curr_socket.state = cmd;
	}
	return curr_socket.state;
}

FINSH_FUNCTION_EXPORT( socketstate, control socket state );

/*调试信息控制输出*/
rt_err_t dbgmsg( uint32_t i )
{
	if( i == 0 )
	{
		rt_kprintf( "debmsg=%d\r\n", fgsm_rawdata_out );
	} else
	{
		fgsm_rawdata_out = i;
	}
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( dbgmsg, dbgmsg count );

/*发送AT命令*/
rt_size_t at_write( char *sinfo )
{
	SendATCmdWaitRespFunc( sinfo, RT_TICK_PER_SECOND * 5, resp_DEBUG,1);
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( at_write, write gsm );


/***********************************************************
* Function:
* Description:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_size_t socket_write( uint8_t linkno, uint8_t* buff, rt_size_t count, rt_int32_t timeout )
{
	rt_size_t	len = count;
	uint8_t		*p	= (uint8_t*)buff;
	uint8_t		c;
	char		*pstr;
	rt_err_t	ret;

	char		buf_start[20];
	char		buf_end[4] = { '"', 0x0d, 0x0a, 0x0 };

	uint8_t		tbl[16] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F' };

	sprintf( buf_start, "AT%%IPSENDX=%d,\"", linkno );
	m66_write( &dev_gsm, 0, buf_start, strlen( buf_start ) );
	rt_kprintf( "%s", buf_start );
	while( len )
	{
		c = *p++;

		USART_SendData( UART4, tbl[c >> 4] );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
		{
		}
		rt_kprintf( "%c", tbl[c >> 4] );
		USART_SendData( UART4, tbl[c & 0x0f] );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
		{
		}
		rt_kprintf( "%c", tbl[c & 0x0f] );
		len--;
	}
	m66_write( &dev_gsm, 0, buf_end, 3 );

