GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/m66.c
	rt_kprintf( "%s", buf_end );

/*todo 在此处处理是否为最优*/
	ret = rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pstr, timeout );
	if( ret == -RT_ETIMEOUT )
	{
		return RT_ETIMEOUT;
	}
	len = ( ( *pstr ) << 8 ) | ( *( pstr + 1 ) );
	if( strstr( pstr + 2, "OK" ) )
	{
		ret = RT_EOK;
	} else
	{
		ret = RT_ERROR;
	}
	rt_free( pstr );

	return ret;
}

FINSH_FUNCTION_EXPORT( socket_write, write socket );


/*
   收到tts信息并发送
   返回0:OK
    1:分配RAM错误
 */
rt_size_t tts_write( char* info )
{
	uint8_t		*pmsg;
	uint16_t	count;
	count = strlen( info );

	/*直接发送到Mailbox中,内部处理*/
	pmsg = rt_malloc( count + 2 );
	if( pmsg != RT_NULL )
	{
		*pmsg			= count >> 8;
		*( pmsg + 1 )	= count & 0xff;
		memcpy( pmsg + 2, info, count );
		rt_mb_send( &mb_tts, (rt_uint32_t)pmsg );
		return 0;
	}
	return 1;
}

FINSH_FUNCTION_EXPORT( tts_write, tts send );

/*控制登录到gprs*/
void ctl_gprs( char* apn, char* user, char*psw, uint8_t fdial )
{
	dial_param.apn		= apn;
	dial_param.user		= user;
	dial_param.psw		= psw;
	dial_param.fconnect = fdial;
	gsm_state = GSM_GPRS;

}

/*连接远程地址*/
void ctl_socket( uint8_t linkno, char type, char* remoteip, uint16_t remoteport, uint8_t fconnect )
{
	curr_socket.linkno	= linkno;
	curr_socket.type	= type;

	strcpy( &( curr_socket.ipstr[0] ), remoteip );
	curr_socket.port = remoteport;
	if( fconnect )
	{
		curr_socket.state = SOCKET_START;
	}else
	{
		curr_socket.state = SOCKET_CLOSE;
	}
	gsm_state=GSM_SOCKET_PROC;

}

/************************************** The End Of File **************************************/
